<div id="bubble">
    <p><a href="http://f0597837.xsph.ru"> Домой </a></p>
  </div>
  <h1 align="center"> Лабораторная работа №2 </h1>
  <h2 align="center"> Задание 3 </h2>
  <?php


  echo'Ассоциативный массив <br>';
  $cust= array("cnum"=>"2001", "cname"=>"Hoffman", "city"=>"London", "snum"=>"1001");
  print_r ($cust);
  echo'<br> ---------------------------------------------------------------------------------------------------------------------------------------------------------------';
  echo '<br><br><br>Добавление ключа rating со значением 100 в массив <br>';
  $cust["rating"] = 100;
  foreach($cust as $k => $v)
  echo  $k, ' => ', $v;

echo'<br> ---------------------------------------------------------------------------------------------------------------------------------------------------------------';
  echo '<br><br><br>Сортировка массива по значениям <br> ';
  asort($cust);
  print_r($cust);
echo'<br> ---------------------------------------------------------------------------------------------------------------------------------------------------------------';
  echo '<br><br><br>Сортировка массива по ключам <br> ';
  ksort($cust);
  print_r($cust);
echo'<br> ---------------------------------------------------------------------------------------------------------------------------------------------------------------';
  echo '<br><br><br>Отсортированный массив <br>';
  sort($cust);
  print_r($cust);
echo'<br> ----------------------------------------------------------------------------------------------------------------------------------------------------------------';




?>
<div id="bubble">
    <p><a href="http://f0597837.xsph.ru/lab2-4.php"> 	&raquo; Самотоятельная работа №1 </a></p>
  </div>
  <div id="bubble">
      <p><a href="http://f0597837.xsph.ru/lab2-2.php"> &laquo; Задание 2 </a></p>
    </div>
